medicalwei/ChibiOS-RT-Community/os/hal/platforms/STM32/DMA2Dv1/stm32_dma2d (copia).c
  chDbgCheck(dma2dp == &DMA2DD1, "dma2dStart");
  chDbgCheck(configp != NULL, "dma2dStart");
  chDbgAssert(dma2dp->state == DMA2D_STOP,
              "dma2dStart(), #1", "invalid state");

  dma2dp->config = configp;

  /* Turn off the controller and its interrupts.*/
  DMA2D->CR = 0;

  // TODO

  dma2dp->state = DMA2D_READY;
  chSysUnlock();
}

/**
 * @brief   Deactivates the DMA2D peripheral.
 *
 * @param[in] dma2dp    pointer to the @p DMA2DDriver object
 *
 * @api
 */
void dma2dStop(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dStop");
  chDbgAssert(dma2dp->state == DMA2D_READY,
              "dma2dStop(), #1", "invalid state");

  dma2dp->state = DMA2D_STOP;
}

#if DMA2D_NEED_MULTITHREADING

void dma2dAcquireS(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dAcquireS");
  chDbgCheckClassS();

  chMtxLockS(&dma2dp->lock);
}

void dma2dAcquire(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dAcquire");

  chSysLock();
  dma2dAcquireS(dma2dp);
  chSysUnlock();
}

void dma2dReleaseS(DMA2DDriver *dma2dp) {

  Mutex *lockp;

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dReleaseS");
  chDbgCheckClassS();
  (void)dma2dp;
  (void)lockp;

  lockp = chMtxUnlockS();
  chDbgCheck(lockp == &dma2dp->lock, "dma2dReleaseS");
}

void dma2dRelease(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dRelease");

  chSysLock();
  dma2dReleaseS(dma2dp);
  chSysUnlock();
}

#endif

uint16_t dma2dGetWatermarkPos(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dGetWatermarkPos");
  (void)dma2dp;

  return (uint16_t)(DMA2D->LWR & DMA2D_LWR_LW);
}

void dma2dSetWatermarkPos(DMA2DDriver *dma2dp, uint16_t line) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dSetWatermarkPos");
  (void)dma2dp;

  DMA2D->LWR = ((uint32_t)line & DMA2D_LWR_LW);
}

bool_t dma2dIsWatermarkEnabled(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dIsWatermarkEnabled");
  (void)dma2dp;

  return (DMA2D->CR & DMA2D_CR_TWIE) != 0;
}

void dma2dEnableWatermark(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dEnableWatermark");
  (void)dma2dp;

  DMA2D->CR |= DMA2D_CR_TWIE;
}

void dma2dDisableWatermark(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dDisableWatermark");
  (void)dma2dp;

  DMA2D->CR &= ~DMA2D_CR_TWIE;
}

uint32_t dma2dGetDeadTime(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dGetDeadTime");
  (void)dma2dp;

  return (DMA2D->AMTCR & DMA2D_AMTCR_DT) >> 8;
}

void dma2dSetDeadTime(DMA2DDriver *dma2dp, uint32_t cycles) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dSetDeadTime");
  chDbgAssert(cycles <= DMA2D_MAX_DEADTIME_CYCLES,
              "dma2dSetDeadTime(), #1", "outside range");
  (void)dma2dp;

  DMA2D->AMTCR = (DMA2D->AMTCR & ~DMA2D_AMTCR_DT) |
                 ((cycles << 8) & DMA2D_AMTCR_DT);
}

bool_t dma2dIsDeadTimeEnabled(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dIsDeadTimeEnabled");
  (void)dma2dp;

  return (DMA2D->AMTCR & DMA2D_AMTCR_EN) != 0;
}

void dma2dEnableDeadTime(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dEnableDeadTime");
  (void)dma2dp;

  DMA2D->AMTCR |= DMA2D_AMTCR_EN;
}

void dma2dDisableDeadTime(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dDisableDeadTime");
  (void)dma2dp;

  DMA2D->AMTCR &= ~DMA2D_AMTCR_EN;
}

void dma2dGetSize(DMA2DDriver *dma2dp, uint16_t *widthp, uint16_t *heightp) {

  uint32_t r;

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dGetSize");
  chDbgCheck(widthp != NULL, "dma2dGetSize");
  chDbgCheck(heightp != NULL, "dma2dGetSize");
  (void)dma2dp;

  r = DMA2D->NLR;
  *widthp  = (r & DMA2D_NLR_PL) >> 16;
  *heightp = (r & DMA2D_NLR_NL) >>  0;
}

void dma2dSetSize(DMA2DDriver *dma2dp, uint16_t width, uint16_t height) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dSetSize");
  chDbgAssert(width <= DMA2D_MAX_WIDTH,
              "dma2dSetSize(), #1", "outside range");
  chDbgAssert(height <= DMA2D_MAX_HEIGHT,
              "dma2dSetSize(), #2", "outside range");
  (void)dma2dp;

  DMA2D->NLR = (((uint32_t)width  << 16) & DMA2D_NLR_PL) |
               (((uint32_t)height <<  0) & DMA2D_NLR_NL);
}

void dma2dJobStart(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dJobStart");
  (void)dma2dp;

  DMA2D->CR |= DMA2D_CR_START;
}

void dma2dJobWaitCompletion(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dJobWaitCompletion");
  (void)dma2dp;

  while (DMA2D->CR & DMA2D_CR_START)
    ;
}

void dma2dJobSuspend(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dJobSuspend");
  (void)dma2dp;

  DMA2D->CR |= DMA2D_CR_SUSP;
}

void dma2dJobResume(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dJobResume");
  (void)dma2dp;

  DMA2D->CR &= ~DMA2D_CR_SUSP;
}

void dma2dJobAbort(DMA2DDriver *dma2dp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dJobAbort");
  (void)dma2dp;

  DMA2D->CR |= DMA2D_CR_ABORT;
}

void *dma2dLayerGetAddress(DMA2DDriver *dma2dp, dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetAddress");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (void *)DMA2D->BGMAR;
  case DMA2D_FG:
    return (void *)DMA2D->FGMAR;
  case DMA2D_OUT:
    return (void *)DMA2D->OMAR;
  default:
    chDbgAssert(FALSE, "dma2dLayerGetAddress(), #1", "invalid layer");
    return NULL;
  }
}

void dma2dLayerSetAddress(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                          void *bufferp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetAddress");
  chDbgCheck(dma2dIsAligned(bufferp, dma2dLayerGetPixelFormat(dma2dp, layer)),
             "dma2dLayerSetAddress");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGMAR = (uint32_t)bufferp;
    return;
  case DMA2D_FG:
    DMA2D->FGMAR = (uint32_t)bufferp;
    return;
  case DMA2D_OUT:
    DMA2D->OMAR = (uint32_t)bufferp;
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetAddress(), #1", "invalid layer");
    return;
  }
}

size_t dma2dLayerGetOffset(DMA2DDriver *dma2dp, dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetOffset");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (size_t)(DMA2D->BGOR & DMA2D_BGOR_LO);
  case DMA2D_FG:
    return (size_t)(DMA2D->FGOR & DMA2D_FGOR_LO);
  case DMA2D_OUT:
    return (size_t)(DMA2D->OOR & DMA2D_OOR_LO);
  default:
    chDbgAssert(FALSE, "dma2dLayerGetOffset(), #1", "invalid layer");
    return 0;
  }
}

void dma2dLayerSetOffset(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                         size_t offset) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetOffset");
  chDbgAssert(offset <= DMA2D_MAX_OFFSET,
              "dma2dLayerSetOffset(), #1", "outside range");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGOR = (uint32_t)offset & DMA2D_BGOR_LO;
    return;
  case DMA2D_FG:
    DMA2D->FGOR = (uint32_t)offset & DMA2D_FGOR_LO;
    return;
  case DMA2D_OUT:
    DMA2D->OOR = (uint32_t)offset & DMA2D_OOR_LO;
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetOffset(), #1", "invalid layer");
    return;
  }
}

uint8_t dma2dLayerGetConstantAlpha(DMA2DDriver *dma2dp,
                                   dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetConstantAlpha");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (uint8_t)((DMA2D->BGPFCCR & DMA2D_BGPFCCR_ALPHA) >> 24);
  case DMA2D_FG:
    return (uint8_t)((DMA2D->FGPFCCR & DMA2D_FGPFCCR_ALPHA) >> 24);
  default:
    chDbgAssert(FALSE, "dma2dLayerGetConstantAlpha(), #1", "invalid layer");
    return 0;
  }
}

void dma2dLayerSetConstantAlpha(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                                uint8_t a) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetConstantAlpha");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGPFCCR = (DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_ALPHA) |
                     (((uint32_t)a << 24) & DMA2D_BGPFCCR_ALPHA);
    return;
  case DMA2D_FG:
    DMA2D->FGPFCCR = (DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_ALPHA) |
                     (((uint32_t)a << 24) & DMA2D_FGPFCCR_ALPHA);
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetConstantAlpha(), #1", "invalid layer");
    return;
  }
}

dma2d_amode_t dma2dLayerGetAlphaMode(DMA2DDriver *dma2dp,
                                     dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetAlphaMode");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (dma2d_amode_t)(DMA2D->BGPFCCR & DMA2D_BGPFCCR_AM);
  case DMA2D_FG:
    return (dma2d_amode_t)(DMA2D->FGPFCCR & DMA2D_FGPFCCR_AM);
  default:
    chDbgAssert(FALSE, "dma2dLayerGetAlphaMode(), #1", "invalid layer");
    return 0;
  }
}

void dma2dLayerSetAlphaMode(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                            dma2d_amode_t mode) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetAlphaMode");
  chDbgAssert((mode & ~DMA2D_BGPFCCR_AM) == 0,
             "dma2dLayerSetAlphaMode(), #1", "outside range");
  chDbgAssert((mode & DMA2D_BGPFCCR_AM) != DMA2D_BGPFCCR_AM,
             "dma2dLayerSetAlphaMode(), #2", "outside range");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGPFCCR = (DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_AM) |
                     ((uint32_t)mode & DMA2D_BGPFCCR_AM);
    return;
  case DMA2D_FG:
    DMA2D->FGPFCCR = (DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_AM) |
                     ((uint32_t)mode & DMA2D_FGPFCCR_AM);
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetConstantAlpha(), #1", "invalid layer");
    return;
  }
}

