medicalwei/ChibiOS-RT-Community/os/hal/platforms/STM32/DMA2Dv1/stm32_dma2d (copia).c
dma2d_pixfmt_t dma2dLayerGetPixelFormat(DMA2DDriver *dma2dp,
                                        dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetPixelFormat");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (dma2d_pixfmt_t)(DMA2D->BGPFCCR & DMA2D_BGPFCCR_CM);
  case DMA2D_FG:
    return (dma2d_pixfmt_t)(DMA2D->FGPFCCR & DMA2D_FGPFCCR_CM);
  case DMA2D_OUT:
    return (dma2d_pixfmt_t)(DMA2D->OPFCCR & DMA2D_OPFCCR_CM);
  default:
    chDbgAssert(FALSE, "dma2dLayerGetPixelFormat(), #1", "invalid layer");
    return 0;
  }
}

void dma2dLayerSetPixelFormat(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                              dma2d_pixfmt_t fmt) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetPixelFormat");
  chDbgAssert(fmt <= DMA2D_MAX_PIXFMT_ID,
              "dma2dLayerSetPixelFormat(), #1", "outside range");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGPFCCR = (DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_CM) |
                     ((uint32_t)fmt & DMA2D_BGPFCCR_CM);
    return;
  case DMA2D_FG:
    DMA2D->FGPFCCR = (DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_CM) |
                     ((uint32_t)fmt & DMA2D_FGPFCCR_CM);
    return;
  case DMA2D_OUT:
    chDbgAssert(fmt <= DMA2D_MAX_OUTPIXFMT_ID,
                "dma2dLayerSetPixelFormat(), #2", "outside range");
    DMA2D->OPFCCR = (DMA2D->OPFCCR & ~DMA2D_OPFCCR_CM) |
                    ((uint32_t)fmt & DMA2D_OPFCCR_CM);
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetPixelFormat(), #3", "invalid layer");
    return;
  }
}

dma2d_color_t dma2dLayerGetDefaultColor(DMA2DDriver *dma2dp,
                                        dma2d_layerid_t layer) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetDeafultColor");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    return (dma2d_color_t)(DMA2D->BGCOLR & 0x00FFFFFF);
  case DMA2D_FG:
    return (dma2d_color_t)(DMA2D->FGCOLR & 0x00FFFFFF);
  case DMA2D_OUT:
    return (dma2d_color_t)(DMA2D->OCOLR & 0x00FFFFFF);
  default:
    chDbgAssert(FALSE, "dma2dLayerGetDeafultColor(), #1", "invalid layer");
    return 0;
  }
}

void dma2dLayerSetDefaultColor(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                               dma2d_color_t c) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetDefaultColor");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGCOLR = (uint32_t)c & 0x00FFFFFF;
    return;
  case DMA2D_FG:
    DMA2D->FGCOLR = (uint32_t)c & 0x00FFFFFF;
    return;
  case DMA2D_OUT:
    DMA2D->OCOLR = (uint32_t)c & 0x00FFFFFF;
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetDeafultColor(), #1", "invalid layer");
    return;
  }
}

void dma2dLayerGetPalette(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                          dma2d_palcfg_t *palettep) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGetPalette");
  chDbgCheck(palettep != NULL, "dma2dLayerGetPalette");
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    palettep->colorsp = (const void *)DMA2D->BGCLUT;
    palettep->length = (uint16_t)((DMA2D->BGPFCCR & DMA2D_BGPFCCR_CS) >> 8) + 1;
    palettep->fmt = (dma2d_pixfmt_t)((DMA2D->BGPFCCR & DMA2D_BGPFCCR_CCM) >> 4);
    return;
  case DMA2D_FG:
    palettep->colorsp = (const void *)DMA2D->FGCLUT;
    palettep->length = (uint16_t)((DMA2D->FGPFCCR & DMA2D_FGPFCCR_CS) >> 8) + 1;
    palettep->fmt = (dma2d_pixfmt_t)((DMA2D->FGPFCCR & DMA2D_FGPFCCR_CCM) >> 4);
    return;
  default:
    chDbgAssert(FALSE, "dma2dLayerGetPalette(), #1", "invalid layer");
    return;
  }
}

void dma2dLayerSetPalette(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                          const dma2d_palcfg_t *palettep) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSetPalette");
  chDbgCheck(palettep != NULL, "dma2dLayerSetPalette");
  chDbgCheck(palettep->colorsp != NULL, "dma2dLayerSetPalette");
  chDbgAssert(palettep->length > 0,
              "dma2dLayerSetPalette(), #1", "outside range");
  chDbgAssert(palettep->length <= DMA2D_MAX_PALETTE_LENGTH,
              "dma2dLayerSetPalette(), #2", "outside range");
  chDbgAssert((palettep->fmt == DMA2D_FMT_ARGB8888) ||
              (palettep->fmt == DMA2D_FMT_RGB888),
              "dma2dLayerSetPalette(), #3", "invalid format")
  (void)dma2dp;

  switch (layer) {
  case DMA2D_BG:
    DMA2D->BGCMAR = (uint32_t)palettep->colorsp;
    DMA2D->BGPFCCR = (DMA2D->BGPFCCR & ~DMA2D_BGPFCCR_CS) |
                     ((((uint32_t)palettep->length - 1) << 8) &
                      DMA2D_BGPFCCR_CS) | ((uint32_t)palettep->fmt << 4);
    DMA2D->BGPFCCR |= DMA2D_BGPFCCR_START;
    while (DMA2D->BGPFCCR & DMA2D_BGPFCCR_START)
      ;
    break;
  case DMA2D_FG:
    DMA2D->FGCMAR = (uint32_t)palettep->colorsp;
    DMA2D->FGPFCCR = (DMA2D->FGPFCCR & ~DMA2D_FGPFCCR_CS) |
                     ((((uint32_t)palettep->length - 1) << 8) &
                      DMA2D_FGPFCCR_CS) | ((uint32_t)palettep->fmt << 4);
    DMA2D->FGPFCCR |= DMA2D_FGPFCCR_START;
    while (DMA2D->FGPFCCR & DMA2D_FGPFCCR_START)
      ;
    break;
  default:
    chDbgAssert(FALSE, "dma2dLayerSetPalette(), #1", "invalid layer");
    return;
  }
}

void dma2dLayerGet(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                   dma2d_laycfg_t *cfgp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerGet");
  chDbgCheck(cfgp != NULL, "dma2dLayerGet");

  cfgp->bufferp = dma2dLayerGetAddress(dma2dp, layer);
  cfgp->offset = dma2dLayerGetOffset(dma2dp, layer);
  cfgp->fmt = dma2dLayerGetPixelFormat(dma2dp, layer);
  cfgp->def_color = dma2dLayerGetDefaultColor(dma2dp, layer);
  cfgp->const_alpha = dma2dLayerGetConstantAlpha(dma2dp, layer);
  if (cfgp->palettep != NULL)
    dma2dLayerGetPalette(dma2dp, layer, (dma2d_palcfg_t *)cfgp->palettep);
}

void dma2dLayerSet(DMA2DDriver *dma2dp, dma2d_layerid_t layer,
                   const dma2d_laycfg_t *cfgp) {

  chDbgCheck(dma2dp == &DMA2DD1, "dma2dLayerSet");
  chDbgCheck(cfgp != NULL, "dma2dLayerSet");

  dma2dLayerSetAddress(dma2dp, layer, cfgp->bufferp);
  dma2dLayerSetOffset(dma2dp, layer, cfgp->offset);
  dma2dLayerSetPixelFormat(dma2dp, layer, cfgp->fmt);
  dma2dLayerSetDefaultColor(dma2dp, layer, cfgp->def_color);
  dma2dLayerSetConstantAlpha(dma2dp, layer, cfgp->const_alpha);
  if (cfgp->palettep != NULL)
    dma2dLayerSetPalette(dma2dp, layer, cfgp->palettep);
}

bool_t dma2dIsAligned(const void *bufferp, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888:
  case DMA2D_FMT_RGB888:
    return ((uintptr_t)bufferp & 3) == 0;
  case DMA2D_FMT_RGB565:
  case DMA2D_FMT_ARGB1555:
  case DMA2D_FMT_ARGB4444:
  case DMA2D_FMT_AL88:
    return ((uintptr_t)bufferp & 1) == 0;
  case DMA2D_FMT_L8:
  case DMA2D_FMT_AL44:
  case DMA2D_FMT_L4:
  case DMA2D_FMT_A8:
  case DMA2D_FMT_A4:
    return TRUE;
  default:
    chDbgAssert(FALSE, "dma2dIsAligned(), #1", "invalid format");
    return FALSE;
  }
}

/**
 * @brief   Compute bits per pixel.
 * @details Computes the bits per pixel for the specified pixel format.
 *
 * @param[in] fmt       pixel format
 *
 * @retuen              bits per pixel
 *
 * @api
 */
size_t dma2dBitsPerPixel(dma2d_pixfmt_t fmt) {

  chDbgAssert(fmt < DMA2D_MAX_PIXFMT_ID,
              "dma2dBitsPerPixel(), #1", "invalid format");

  return (size_t)dma2d_bpp[(unsigned)fmt];
}

