medicalwei/ChibiOS-RT-Community/os/hal/platforms/STM32/DMA2Dv1/stm32_dma2d (copia).c
#if DMA2D_NEED_CONVERSIONS || defined(__DOXYGEN__)

/**
 * @brief   Convert from ARGB-8888.
 * @details Converts an ARGB-8888 color to the specified pixel format.
 *
 * @param[in] c         color, ARGB-8888
 * @param[in] fmt       target pixel format
 *
 * @return              raw color value for the target pixel format, left
 *                      padded with zeros.
 *
 * @api
 */
dma2d_color_t dma2dFromARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888: {
    return c;
  }
  case DMA2D_FMT_RGB888: {
    return c & 0x00FFFFFF;
  }
  case DMA2D_FMT_RGB565: {
    return ((c & 0x000000F8) >> ( 8 -  5)) |
           ((c & 0x0000FC00) >> (16 - 11)) |
           ((c & 0x00F80000) >> (24 - 16));
  }
  case DMA2D_FMT_ARGB1555: {
    return ((c & 0x000000F8) >> ( 8 -  5)) |
           ((c & 0x0000F800) >> (16 - 10)) |
           ((c & 0x00F80000) >> (24 - 15)) |
           ((c & 0x80000000) >> (32 - 16));
  }
  case DMA2D_FMT_ARGB4444: {
    return ((c & 0x000000F0) >> ( 8 -  4)) |
           ((c & 0x0000F000) >> (16 -  8)) |
           ((c & 0x00F00000) >> (24 - 12)) |
           ((c & 0xF0000000) >> (32 - 16));
  }
  case DMA2D_FMT_L8: {
    return c & 0x000000FF;
  }
  case DMA2D_FMT_AL44: {
    return ((c & 0x000000F0) >> ( 8 - 4)) |
           ((c & 0xF0000000) >> (32 - 8));
  }
  case DMA2D_FMT_AL88: {
    return ((c & 0x000000FF) >> ( 8 -  8)) |
           ((c & 0xFF000000) >> (32 - 16));
  }
  // TODO
  default:
    chDbgPanic("invalid format");
    return 0;
  }
}

/**
 * @brief   Convert to ARGB-8888.
 * @details Converts color of the specified pixel format to an ARGB-8888 color.
 *
 * @param[in] c         color for the source pixel format, left padded with
 *                      zeros.
 * @param[in] fmt       source pixel format
 *
 * @return              color in ARGB-8888 format
 *
 * @api
 */
dma2d_color_t dma2dToARGB8888(dma2d_color_t c, dma2d_pixfmt_t fmt) {

  switch (fmt) {
  case DMA2D_FMT_ARGB8888: {
    return c;
  }
  case DMA2D_FMT_RGB888: {
    return (c & 0x00FFFFFF) | 0xFF000000;
  }
  case DMA2D_FMT_RGB565: {
    register dma2d_color_t output = 0xFF000000;
    if (c & 0x001F) output |= ((c & 0x001F) << ( 8 -  5)) | 0x00000007;
    if (c & 0x07E0) output |= ((c & 0x07E0) << (16 - 11)) | 0x00000300;
    if (c & 0xF800) output |= ((c & 0xF800) << (24 - 16)) | 0x00070000;
    return output;
  }
  case DMA2D_FMT_ARGB1555: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x001F) output |= ((c & 0x001F) << ( 8 -  5)) | 0x00000007;
    if (c & 0x03E0) output |= ((c & 0x03E0) << (16 - 10)) | 0x00000700;
    if (c & 0x7C00) output |= ((c & 0x7C00) << (24 - 15)) | 0x00070000;
    if (c & 0x8000) output |= 0xFF000000;
    return output;
  }
  case DMA2D_FMT_ARGB4444: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x000F) output |= ((c & 0x000F) << ( 8 -  4)) | 0x0000000F;
    if (c & 0x00F0) output |= ((c & 0x00F0) << (16 -  8)) | 0x00000F00;
    if (c & 0x0F00) output |= ((c & 0x0F00) << (24 - 12)) | 0x000F0000;
    if (c & 0xF000) output |= ((c & 0xF000) << (32 - 16)) | 0x0F000000;
    return output;
  }
  case DMA2D_FMT_L8: {
    return (c & 0xFF) | 0xFF000000;
  }
  case DMA2D_FMT_AL44: {
    register dma2d_color_t output = 0x00000000;
    if (c & 0x0F) output |= ((c & 0x0F) << ( 8 - 4)) | 0x0000000F;
    if (c & 0xF0) output |= ((c & 0xF0) << (32 - 8)) | 0x0F000000;
    return output;
  }
  case DMA2D_FMT_AL88: {
    return ((c & 0x00FF) << ( 8 -  8)) |
           ((c & 0xFF00) << (32 - 16));
  }
  // TODO
  default:
    chDbgAssert(FALSE, "(), #1", "invalid format");
    return 0;
  }
}

#endif /* DMA2D_NEED_CONVERSIONS */

/** @} */

#endif /* STM32_DMA2D_USE_DMA2D */
